# UDEMY MySQL Bootcamp Course

Completed Section 1 of Course May 20th, 2021

Signed up for GOORM IDE and created new workspace for course May 23, 2021

Completed Section 2 of Course May 23, 2021

Completed Lecture Videos Section 3 # 17-26 May 23, 2021

Lecture 27 - Basic Data Types Challenge
    Draw a Tweets Table
        - A username (max 15 characters)
        - The Tweet Content (max 140 characters)
        - Number of Favorites
    My_Tweet_Table
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Solution
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Challege is Correct
    Challenge Completed May 23, 2021

Completed Lecture Videos Section 3 # 29-34 May 23, 2021

Lecture 35 - Creating Your Own Tables Challenge
    Pastries Table
        - Should atleast include columns name (50 characters max) and quantity
        - Inspect your table/columsn in cli
        - Delete the table

In [1]:
# Lecture 35 Challenge
# CREATE TABLE pastries(
#    -> name VARCHAR(50),
#    -> number INT,
#    -> price INT
#    -> );
# SHOW TABLES;
# SHOW COLUMNS FROM pastries;
# DROP TABLE pastries;
# SHOW TABLES;

In [2]:
# Lecture 35 Solution
# CREATE TABLE pastries
#   (
#     name VARCHAR(50),
#     quantity INT
#   );
 
# SHOW TABLES;
 
# DESC pastries;
 
# DROP TABLE pastries;
# Slight syntax difference between work and solution. Still correct.
# Completed Lecture 35 Code Challenge May 23, 2021

Completed Section 3 May 23, 2021

Completed Lecture Videos Section 4 # 37-43 May 25th, 2021

In [1]:
# Lecture 44 Challenge
# CREATE TABLE people (
#    -> first_name VARCHAR(20),
#    -> last_name VARCHAR(20),
#    -> age INT
#    -> );
#
# INSERT INTO people(first_name, last_name, age) VALUES('Tina', 'Belcher', 13);
# SELECT * FROM people;
#
# INSERT INTO people(age, first_name, last_name) VALUES (42, 'Bob', 'Belcher');
# SELECT * FROM people;
#
# INSERT INTO people(first_name, last_name, age) VALUES ('Linda', 'Belcher', 45), ('Phillip', 'Frond', 38), ('Calvin', 'F
# ischoeder', 70);
# SELECT * FROM people;

In [2]:
# INSERT CHALLENGE SOLUTION
# CREATE TABLE people
#   (
#     first_name VARCHAR(20),
#     last_name VARCHAR(20),
#     age INT
#   );
# INSERT INTO people(first_name, last_name, age)
# VALUES ('Tina', 'Belcher', 13);
# INSERT INTO people(age, last_name, first_name)
# VALUES (42, 'Belcher', 'Bob');
# INSERT INTO people(first_name, last_name, age)
# VALUES('Linda', 'Belcher', 45)
#   ,('Phillip', 'Frond', 38)
#   ,('Calvin', 'Fischoeder', 70);
# Slight Difference between work and solution. Still correct.
# Completed Lecture 44 Code Challenge May 28, 2021

Completes Lecture Videos Section 4 # 48 - 56 May 29, 2021

In [1]:
# Lecture 57 CHALLENGE
# CREATE TABLE Employees(
#     -> id INT NOT NULL AUTO_INCREMENT,
#     -> last_name VARCHAR(20) NOT NULL,
#     -> first_name VARCHAR(20) NOT NULL,
#     -> middle_name VARCHAR(20),
#     -> age INT NOT NULL,
#     -> current_status VARCHAR(50) NOT NULL DEFAULT 'employed',
#     -> PRIMARY KEY (id)
#     -> );
#
# INSERT INTO Employees(last_name, first_name, middle_name, age, current_status) VALUES ('Smith', 'John', 'William', 23,
# 'employed')

In [2]:
# Lecture 57 SOLUTION
# CREATE TABLE employees (
#     id INT AUTO_INCREMENT NOT NULL,
#     first_name VARCHAR(255) NOT NULL,
#     last_name VARCHAR(255) NOT NULL,
#     middle_name VARCHAR(255),
#     age INT NOT NULL,
#     current_status VARCHAR(255) NOT NULL DEFAULT 'employed',
#     PRIMARY KEY(id)
# );
#
# Slight Difference in order of words between work and solution. Still Correct.
# Completed May 30th, 2021

Completed Section 4 May 30, 2021

Completed Video Lectures Section 5 # 60-68

In [1]:
# Lecture 69 CHALLENGE
#
# SELECT cat_id FROM cats;
#
# SELECT name, breed FROM cats;
#
# SELECT name, age FROM cats
#    -> WHERE breed = 'Tabby';
#
# SELECT cat_id, age FROM cats
#     -> WHERE cat_id = age;

In [2]:
# Lecture 69 SOLUTION
# SELECT cat_id FROM cats; 

# SELECT name, breed FROM cats; 

# SELECT name, age FROM cats WHERE breed='Tabby'; 

# SELECT cat_id, age FROM cats WHERE cat_id=age; 

# SELECT * FROM cats WHERE cat_id=age; 

# Work is correct. Completed May 31, 2021

Completes Video Lectures Section 5 # 72 - 75

In [1]:
# Lecture 76 CHALLENGE

# UPDATE cats SET name = 'Jack'
#    -> WHERE name = 'Jackson';

# UPDATE cats SET breed = 'British Shorthair'
# -> WHERE name = 'Ringo';

# UPDATE cats SET age = 12
#    -> WHERE breed = 'Maine Coon';

In [2]:
# Lecture 76 SOLUTION

# SELECT * FROM cats WHERE name='Jackson';
 
### UPDATE cats SET name='Jack' WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jack';
 
# SELECT * FROM cats WHERE name='Ringo';
 
### UPDATE cats SET breed='British Shorthair' WHERE name='Ringo';
 
# SELECT * FROM cats WHERE name='Ringo';
 
# SELECT * FROM cats;

# SELECT * FROM cats WHERE breed='Maine Coon';
 
### UPDATE cats SET age=12 WHERE breed='Maine Coon';
 
# SELECT * FROM cats WHERE breed='Maine Coon';

# Work is correct. Completed May 31, 2021

Completes Video Lecture 79-80

In [1]:
# Lecture 81 CODE CHALLENGE
# 
# DELETE FROM cats WHERE age = 4;
#
# DELETE FROM cats where cat_id = age;
#
# DELETE FROM cats;

In [2]:
# Lecture 81 CODE SOLUTION

# SELECT * FROM cats WHERE age=4;
 
# DELETE FROM cats WHERE age=4;
 
# SELECT * FROM cats WHERE age=4;
 
# SELECT * FROM cats;
 
# SELECT *  FROM cats WHERE cat_id=age;
 
# DELETE FROM cats WHERE cat_id=age;
 
# DELETE FROM cats;
 
# SELECT * FROM cats;

# Work is correct. Completed June 5th, 2021

COMPLETED SECTION 5 June 5th, 2021

Completes Video Lecture 84

In [1]:
# SECTION 6 CRUD Exercises
# CREATE EXERCISE

# CREATE DATABASE shirts_db;

# USE shirts_db;

# CREATE TABLE shirts (
#     -> shirt_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
#     -> article VARCHAR(50),
#     -> color VARCHAR(50),
#     -> shirt_size VARCHAR(10),
#     -> last_worn INT
#     -> );

# INSERT INTO shirts (article, color, shirt_size, last_worn) VALUES
#     -> ('t-shirt', 'white', 'S', 10),
#     -> ('t-shirt', 'green', 'S', 200),
#     -> ('polo shirt', 'black', 'M', 10),
#     -> ('tank top', 'blue', 'S', 50),
#     -> ('t-shirt', 'pink', 'S', 0),
#     -> ('polo shirt', 'red', 'M', 5),
#     -> ('tank top', 'white', 'S', 200),
#     -> ('tank top', 'blue', 'M', 15);

# INSERT INTO shirts (article, color, shirt_size, last_worn) VALUES ('polo shirt', 'purple', 'M', 50);

In [2]:
# SECTION 6 CRUD Exercises
# CREATE EXERCISE SOLUTION

# SELECT database();
 
# CREATE DATABASE shirts_db;
 
# use shirts_db;
 
# SELECT database();
 
# CREATE TABLE shirts
#   (
#     shirt_id INT NOT NULL AUTO_INCREMENT,
#     article VARCHAR(100),
#     color VARCHAR(100),
#     shirt_size VARCHAR(100),
#     last_worn INT,
#     PRIMARY KEY(shirt_id)
#   );
 
# DESC shirts;
 
# INSERT INTO shirts(article, color, shirt_size, last_worn) VALUES
# ('t-shirt', 'white', 'S', 10),
# ('t-shirt', 'green', 'S', 200),
# ('polo shirt', 'black', 'M', 10),
# ('tank top', 'blue', 'S', 50),
# ('t-shirt', 'pink', 'S', 0),
# ('polo shirt', 'red', 'M', 5),
# ('tank top', 'white', 'S', 200),
# ('tank top', 'blue', 'M', 15);
 
# SELECT * FROM shirts;
 
# INSERT INTO shirts(color, article, shirt_size, last_worn) 
# VALUES('purple', 'polo shirt', 'medium', 50);
 
# SELECT * FROM shirts;

# Work is correct. Completed June 5, 2021

In [1]:
# SECTION 6 CRUD Exercises
# READ EXERCISE

# SELECT article, color FROM shirts;

# SELECT article, color, shirt_size, last_worn FROM shirts WHERE shirt_size = 'M';

In [2]:
# SECTION 6 CRUD Exercises
# READ EXERCISE SOLUTION

# SELECT article, color FROM shirts;
 
# SELECT * FROM shirts WHERE shirt_size='M';
 
# SELECT article, color, shirt_size, last_worn FROM shirts WHERE shirt_size='M';

# Work is correct. Completed June 5, 2021

In [1]:
# SECTION 6 CRUD Exercises
# UPDATE EXERCISE

# PROBLEM: UPDATE all polo shirts, change their size to L
# UPDATE shirts SET shirt_size = 'L' WHERE article = 'polo shirt';
# SELECT * FROM shirts;

# PROBLEM: UPDATE shirt last worn 15 days ago, change last_worn to 0
# UPDATE shirts SET last_worn = 0 WHERE last_worn = 15;
# SELECT * FROM shirts;

# PROBLEM: UPDATE all white shirts, change size to 'XS' and color to 'off white'
# UPDATE shirts SET shirt_size = 'XS', color = 'off white' WHERE color = 'white';
# SELECT * FROM shirts;

In [2]:
# SECTION 6 CRUD EXERCISES
# UPDATE EXERCISE SOLUTION

# SELECT * FROM shirts WHERE article='polo shirt';
 
# UPDATE shirts SET shirt_size='L' WHERE article='polo shirt';
 
# SELECT * FROM shirts WHERE article='polo shirt';
 
# SELECT * FROM shirts;
 
# SELECT * FROM shirts WHERE last_worn=15;
 
# UPDATE shirts SET last_worn=0 WHERE last_worn=15;
 
# SELECT * FROM shirts WHERE last_worn=15;
 
# SELECT * FROM shirts WHERE last_worn=0;
 
# SELECT * FROM shirts WHERE color='white';
 
# UPDATE shirts SET color='off white', shirt_size='XS' WHERE color='white';
 
# SELECT * FROM shirts WHERE color='white';
 
# SELECT * FROM shirts WHERE color='off white';
 
# SELECT * FROM shirts;

# Solution is slightly different when checking the values being changed. The work itself is still correct.
# Completed June 12, 2021

In [1]:
# SECTION 6 CRUD EXERCISES
# DELETE EXERCISE

# PROBLEM: Delete all old shirts, where last_worn = 200
# DELETE FROM shirts WHERE last_worn = 200;
# SELECT * FROM shirts;

# PROBLEM: Delete all tank tops
# DELETE FROM shirts WHERE article = 'tank top';
# SELECT * FROM shirts;

# PROBLEM: Delete all shirts
# DELETE FROM shirts;
# SELECT * FROM shirts;

# PROBLEM: Drop the entire shirts table
# DROP TABLE shirts;
# SHOW TABLES;

In [2]:
# SECTION 6 CRUD EXERCISES
# DELETE EXERCISE SOLUTION

# SELECT * FROM shirts;
 
# SELECT * FROM shirts WHERE last_worn=200;
 
# DELETE FROM shirts WHERE last_worn=200;
 
# SELECT * FROM shirts WHERE article='tank top';
 
# DELETE FROM shirts WHERE article='tank top';
 
# SELECT * FROM shirts WHERE article='tank top';
 
# SELECT * FROM shirts;
 
# DELETE FROM shirts;
 
# SELECT * FROM shirts;
 
# DROP TABLE shirts;
 
# show tables;
 
# DESC shirts;

# WORK IS CORRECT. COMPLETED June 12, 2021

Completes Section 6 June 12, 2021

Completes Video Lectures 94 - 99 June 12, 2021

Completes Video Lectures 100 - 112 June 13, 2021

In [1]:
# Code Challenge from Lecture 113

# Reverse and uppercase the following sentence: Why does my cat look at me with such hatred?
# SELECT REVERSE(UPPER('Why does my cat look at me with such hatred?'));

# What does the following return, without testing it:
# SELECT REPLACE(CONCAT('I', ' ', 'like', ' ', 'cats'), ' ', '-');
# "I-like-cats"

# Replaces spaces in titles with '->'
# SELECT REPLACE(title, ' ', '->') AS 'title' FROM books;

# Print out column with last_name forward and a column with it backwards
# SELECT author_lname AS 'forwards', REVERSE(author_lname) AS 'backwards' FROM books;

# Print Full Name in CAPS
# SELECT UPPER(CONCAT(author_fname, ' ', author_lname)) AS 'full name in caps' FROM books;

# Print a blurb with the title and when it was released
# SELECT CONCAT(title, ' was released in ', released_year) AS 'blurb' FROM books;

# Print book titles and the length of the titles
# SELECT title, CHAR_LENGTH(title) AS 'character count' FROM books;

# Print short title, author, and number in stock
# SELECT CONCAT(SUBSTRING(title, 1, 10), '...') AS 'short title',
#     -> CONCAT(author_lname, ', ', author_fname) AS 'author',
#     -> CONCAT(stock_quantity, ' in stock') AS 'quantity'
#     -> FROM books;

In [2]:
# CODE CHALLENGE SOLUTION

# SELECT UPPER(REVERSE('Why does my cat look at me with such hatred?')); 
# OR
# SELECT REVERSE(UPPER('Why does my cat look at me with such hatred?'));

# SELECT REPLACE(CONCAT('I', ' ', 'like', ' ', 'cats'), ' ', '-'); 

# SELECT REPLACE(title, ' ', '->') AS title FROM books; 

# SELECT 
#    author_lname AS forwards,
#    REVERSE(author_lname) AS backwards 
# FROM books;


# SELECT
#    UPPER
#    (
#       CONCAT(author_fname, ' ', author_lname)
#    ) AS 'full name in caps'
# FROM books;

# SELECT
#    CONCAT(title, ' was released in ', released_year) AS blurb
# FROM books;

# SELECT
#    title,
#    CHAR_LENGTH(title) AS 'character count'
# FROM books;

# SELECT
#    CONCAT(SUBSTRING(title, 1, 10), '...') AS 'short title',
#    CONCAT(author_lname, ',', author_fname) AS author,
#    CONCAT(stock_quantity, ' in stock') AS quantity
# FROM books;

# Work is correct. Completed Jan 13, 2021

Completed Section 7

Completed Section 8 Video Lectures # 116 - 128 June 16, 2021

In [1]:
# SECTION 8 CODE CHALLENGE (LECTURE 130)

# SELECT title from books WHERE title LIKE '%stories%';

# SELECT title, pages from books ORDER BY pages DESC LIMIT 1;

# SELECT CONCAT(title, ' - ', released_year) AS summary FROM books ORDER BY released_year DESC LIMIT 3;

# SELECT title, author_lname FROM books WHERE author_lname LIKE '% %';

# SELECT title, released_year, stock_quantity FROM books ORDER BY stock_quantity, title LIMIT 3;

# SELECT title, author_lname FROM books ORDER BY author_lname, title;

# SELECT CONCAT('MY FAVORITE AUTHOR IS ', UPPER(author_fname), ' ', UPPER(author_lname), '!') AS 'yell' FROM books ORDER BY author_lname;

In [2]:
# SECTION 8 CODE CHALLENGE SOLUTION (LECTURE 131&132)

# SELECT title FROM books WHERE title LIKE '%stories%';
 
# SELECT title, pages FROM books ORDER BY pages DESC LIMIT 1;
 
# SELECT 
#     CONCAT(title, ' - ', released_year) AS summary 
# FROM books ORDER BY released_year DESC LIMIT 3;
 
# SELECT title, author_lname FROM books WHERE author_lname LIKE '% %';
 
# SELECT title, released_year, stock_quantity 
# FROM books ORDER BY stock_quantity LIMIT 3;
 
# SELECT title, author_lname 
# FROM books ORDER BY author_lname, title;
 
# SELECT title, author_lname 
# FROM books ORDER BY 2,1;
 
# SELECT
#     CONCAT(
#         'MY FAVORITE AUTHOR IS ',
#         UPPER(author_fname),
#         ' ',
#         UPPER(author_lname),
#         '!'
#     ) AS yell
# FROM books ORDER BY author_lname;

# WORK IS CORRECT! COMPLETED JUNE 16, 2021

Completed Section 8 June 16, 2021

Completed Section 9 Lecture Videos # 132 - 147 June 16, 2021

In [1]:
# SECTION 8 CODE CHALLENGE (LECTURE 148)

# SELECT COUNT(*) FROM books;

# SELECT released_year, COUNT(*) FROM books GROUP BY released_year;

# SELECT SUM(stock_quantity) FROM books;

# SELECT author_fname, author_lname, AVG(released_year) FROM books ORDER BY author_lname, author_fname;

# SELECT CONCAT(author_fname, ' ', author_lname) AS 'Full Name', pages FROM books ORDER BY pages DESC LIMIT 1;

# SELECT released_year AS year, COUNT(*) AS '# of books', AVG(pages) AS 'avg pages' FROM books GROUP BY released_year;

In [2]:
# SECTION 8 CODE CHALLENGE SOLUTION (LECTURE 149-150)

# SELECT COUNT(*) FROM books;
 
# SELECT COUNT(*) FROM books GROUP BY released_year;
 
# SELECT released_year, COUNT(*) FROM books GROUP BY released_year;
 
# SELECT Sum(stock_quantity) FROM BOOKS;
 
# SELECT AVG(released_year) FROM books GROUP BY author_lname, author_fname;
 
# SELECT author_fname, author_lname, AVG(released_year) FROM books GROUP BY author_lname, author_fname;
 
# SELECT CONCAT(author_fname, ' ', author_lname) FROM books
# WHERE pages = (SELECT Max(pages) FROM books);
 
# SELECT CONCAT(author_fname, ' ', author_lname) FROM books
# ORDER BY pages DESC LIMIT 1;
 
# SELECT pages, CONCAT(author_fname, ' ', author_lname) FROM books
# ORDER BY pages DESC;
 
# SELECT released_year AS year,
#     COUNT(*) AS '# of books',
#     AVG(pages) AS 'avg pages'
# FROM books
#     GROUP BY released_year;

# WORK IS CORRECT. COMPLETED JUNE 16, 2021

COMPLETED SECTION 9. JUNE 16, 2021

COMPLETED SECTION 10 VIDEO LECTURES 151 - 170 June 20, 2021

In [1]:
# SECTION 10 CODE CHALLENGE (LECTURE 171)

# When is a good use case for CHAR?
# If you have a column for States. Each State has a two letter abbreviation and CHAR(2) can be used without wasting memory

# Fill in the blanks
#.   VARCHAR
#.   DECIMAL(8, 2)
#.   INT

# What is the difference between datatime and timestamp?
#    The major difference between the two is that timestamp converts the time to UTC and when queried, it will
#    convert from UTC to the current time zone, which is useful for companies that may work in multiple time zones
#    Tmestamp also will only work during a certain set of years, which is shorted than datetime.

# Print out the current time.
#    SELECT CURTIME()

# Print out the current date.
#    SELECT CURDATE()

# Print out the current day of the week (the number).
#.   SELECT DAYOFWEEK(CURDATE())

# Print out the current day of the week (the day name).
#    SELECT DAYNAME(CURDATE())

# Print out the current day and time using this format: mm/dd/yyyy
#    SELECT DATE_FORMAT(CURDATE(), '%m/%d/%Y')

# Print out the current day and time using this format: January 2nd at 3:15, April 1st at 10:18
#    SELECT DATE_FORMAT(NOW(), '%M %D at %h:%i')

# CREATE TABLE tweets (content VARCHAR(140), username VARCHAR(20), time TIMESTAMP DEFAULT NOW())

In [2]:
# SECTION 10 CODE CHALLENGE SOLUTION (LECTURE 172 - 173)

# What's a good use case for CHAR?
# ------
# Used for text that we know has a fixed length, e.g., State abbreviations, 
# abbreviated company names, sex M/F, etc.
 
# CREATE TABLE inventory (
#     item_name VARCHAR(100),
#     price DECIMAL(8,2),
#     quantity INT
# );
 
# What's the difference between DATETIME and TIMESTAMP?
# ------
# They both store datetime information, but there's a difference in the range, 
# TIMESTAMP has a smaller range. TIMESTAMP also takes up less space. 
# TIMESTAMP is used for things like meta-data about when something is created
# or updated.
 
# SELECT CURTIME();
 
# SELECT CURDATE()';
 
# SELECT DAYOFWEEK(CURDATE());
# SELECT DAYOFWEEK(NOW());
# SELECT DATE_FORMAT(NOW(), '%w') + 1;
 
# SELECT DAYNAME(NOW());
# SELECT DATE_FORMAT(NOW(), '%W');
 
# SELECT DATE_FORMAT(CURDATE(), '%m/%d/%Y');
 
# SELECT DATE_FORMAT(NOW(), '%M %D at %h:%i');
 
# CREATE TABLE tweets(
#     content VARCHAR(140),
#     username VARCHAR(20),
#     created_at TIMESTAMP DEFAULT NOW()
# );
 
# INSERT INTO tweets (content, username) VALUES('this is my first tweet', 'coltscat');
# SELECT * FROM tweets;
 
# INSERT INTO tweets (content, username) VALUES('this is my second tweet', 'coltscat');
# SELECT * FROM tweets;

# Work is correct. COMPLETED June 26th, 2021

COMPLETED SECTION 10 JUNE 26th, 2021

COMPLETED VIDEO LECTURES 174 - 184 JUNE 26th, 2021

COMPLETED VIDEO LECTURES 185-192 JUNE 26th, 2021

In [1]:
# SECTION 11 CODE CHALLENGE (LECTURE 193)

# Evaluate the following...

# SELECT 10 != 10; Will Return 0 (FALSE)
# SELECT 15 > 14 && 99 - 5 <= 94; Will return 1 (TRUE)
# SELECT 1 IN (5,3) || 9 BETWEEN 8 AND 10; Will return 1 (TRUE)

# Select All Books Written Before 1980 (non inclusive)
# SELECT * FROM books WHERE released_year < 1980;

# Select All Books Written By Eggers Or Chabon
# SELECT * FROM books WHERE author_lname IN ('EGGERS', 'CHABON');

# Select All Books Written By Lahiri, Published after 2000
# SELECT * FROM books WHERE author_lname = 'Lahiri' AND released_year > 2000;

# Select All books with page counts between 100 and 200
# SELECT * FROM books WHERE pages BETWEEN 100 AND 200;

# Select all books where author_lname  starts with a 'C' or an 'S''
# SELECT * FROM books WHERE author_lname LIKE 'C%' OR author_lname LIKE 'S%';

# If title contains 'stories'   -> Short Stories, Just Kids and A Heartbreaking Work  -> Memoir, Everything Else -> Novel
# SELECT title, author_lname, 
#    -> CASE 
#        -> WHEN title LIKE '%stories%' THEN 'Short Stories'
#        -> WHEN title LIKE '%Just KIDS%' OR title LIKE '%A Heartbreaking Work%' THEN 'Memoir'
#        -> ELSE 'Novel'
#    -> END AS 'Type'
# -> FROM books;

# Bonus: Make This Happen
# SELECT author_lname, CASE
#     -> WHEN COUNT(*) = 1 THEN CONCAT(COUNT(*), ' book')
#     -> ELSE CONCAT(COUNT(*), ' books')
#     -> END AS COUNT
#     -> FROM books
#     -> GROUP BY author_lname, author_fname;

In [2]:
# SECTION 11 CODE CHALLENGE SOLUTION (LECTURE 194-195)

# SELECT 10 != 10;
# -- false
 
# SELECT 15 > 14 && 99 - 5 <= 94;
# -- true
 
# SELECT 1 IN (5,3) || 9 BETWEEN 8 AND 10;
# -- true
 
# SELECT title, released_year FROM books WHERE released_year < 1980;
 
# SELECT title, author_lname FROM books WHERE author_lname='Eggers' OR author_lname='Chabon';
 
# SELECT title, author_lname FROM books WHERE author_lname IN ('Eggers','Chabon'); (USED THIS VERSION)
 
# SELECT title, author_lname, released_year FROM books WHERE author_lname = 'Lahiri' && released_year > 2000;
 
# SELECT title, pages FROM books WHERE pages >= 100 && pages <=200;
 
# SELECT title, pages FROM books WHERE pages BETWEEN 100 AND 200; (USED THIS VERSION)
 
# SELECT 
#     title, 
#     author_lname 
# FROM books 
# WHERE 
#     author_lname LIKE 'C%' OR 
#     author_lname LIKE 'S%'; (USED THIS VERSION)
 
# SELECT 
#     title, 
#     author_lname 
# FROM books 
# WHERE 
#     SUBSTR(author_lname,1,1) = 'C' OR 
#     SUBSTR(author_lname,1,1) = 'S';
 
# SELECT title, author_lname FROM books 
# WHERE SUBSTR(author_lname,1,1) IN ('C', 'S');
 
# SELECT 
#     title, 
#     author_lname,
#     CASE
#         WHEN title LIKE '%stories%' THEN 'Short Stories'
#         WHEN title = 'Just Kids' OR title = 'A Heartbreaking Work of Staggering Genius' THEN 'Memoir'
#         ELSE 'Novel'
#     END AS TYPE
# FROM books; (USED LIKE STATEMENT INSTEAD OF = SO THAT SECOND NOVEL DID NOT HAVE TO BE WRITTEN OUT COMPLETELY)
 
# SELECT author_fname, author_lname,
#     CASE 
#         WHEN COUNT(*) = 1 THEN '1 book'
#         ELSE CONCAT(COUNT(*), ' books')
#     END AS COUNT
# FROM books 
# GROUP BY author_lname, author_fname; (THE FIRST CASE IS HARD CODED, I USED CONCAT FOR BOTH)

# SMALL DIFFERENCES IN SYNTAX, BUT ALL CODING CHALLENGES HAVE THE CORRECT RESULT
# COMPLETED JUNE 27TH, 2021

COMPLETED SECTION 11 JUNE 27TH, 2021

COMPLETED SECTION 12 VIDEO LECTURES 197-206 JUNE 27th, 2021

COMPLETED SECTION 12 VIDEO LECTURES 206-214 JULY 3, 2021

In [1]:
# SECTION 12 CODE CHALLENGE (LECTURE 215)

# CREATE DATABASE section12_student;
# USE section12_student;
# CREATE TABLE students (
#     -> id INT AUTO_INCREMENT PRIMARY KEY,
#     -> first_name VARCHAR(100)
#     -> );
# CREATE TABLE papers (
#     -> title VARCHAR(100),
#     -> grade INT,
#     -> student_id INT,
#     -> FOREIGN KEY(student_id) REFERENCES students(id)
#     -> );

# INSERT INTO students (first_name) VALUES 
# ('Caleb'), ('Samantha'), ('Raj'), ('Carlos'), ('Lisa');

# INSERT INTO papers (student_id, title, grade ) VALUES
# (1, 'My First Book Report', 60),
# (1, 'My Second Book Report', 75),
# (2, 'Russian Lit Through The Ages', 94),
# (2, 'De Montaigne and The Art of The Essay', 98),
# (4, 'Borges and Magical Realism', 89);

# SELECT first_name, title, grade FROM students
#     -> JOIN papers
#     -> ON students.id = papers.student_id
#     -> ORDER BY grade DESC;

# SELECT first_name, title, grade FROM students
#     -> LEFT JOIN papers
#     -> ON students.id = papers.student_id;

# SELECT
#     -> first_name,
#     -> IFNULL(title, 'Missing') AS title,
#     -> IFNULL(grade, 0) AS grade
#     -> FROM students
#     -> LEFT JOIN papers
#     -> ON students.id = papers.student_id;

# SELECT first_name, AVG(IFNULL(grade, 0)) AS average FROM students
#     -> LEFT JOIN papers
#     -> ON students.id = papers.student_id
#     -> GROUP BY first_name
#     -> ORDER BY average DESC;

# SELECT 
#     first_name,
#     AVG(IFNULL(grade, 0)) AS 'average',
#     CASE
#         WHEN AVG(IFNULL(grade, 0)) > 75 THEN 'PASSING'
#         ELSE 'FAILING'
#     END AS 'passing_status'
# FROM students
# LEFT JOIN papers
#     ON students.id = papers.student_id
# GROUP BY first_name
# ORDER BY average DESC;

In [2]:
# SECTION 12 CODE CHALLENGE SOLUTION (Lectures 216 - 219)

# CREATE TABLE students (
#     id INT AUTO_INCREMENT PRIMARY KEY,
#     first_name VARCHAR(100)
# );
 
# CREATE TABLE papers (
#     title VARCHAR(100),
#     grade INT,
#     student_id INT,
#     FOREIGN KEY (student_id) 
#         REFERENCES students(id)
#         ON DELETE CASCADE
# );

# INSERT INTO students (first_name) VALUES 
# ('Caleb'), 
# ('Samantha'), 
# ('Raj'), 
# ('Carlos'), 
# ('Lisa');
 
# INSERT INTO papers (student_id, title, grade ) VALUES
# (1, 'My First Book Report', 60),
# (1, 'My Second Book Report', 75),
# (2, 'Russian Lit Through The Ages', 94),
# (2, 'De Montaigne and The Art of The Essay', 98),
# (4, 'Borges and Magical Realism', 89);

# SELECT first_name, title, grade
# FROM students
# INNER JOIN papers
#     ON students.id = papers.student_id
# ORDER BY grade DESC;

# SELECT first_name, title, grade
# FROM students
# LEFT JOIN papers
#     ON students.id = papers.student_id;

# SELECT
#     first_name,
#     IFNULL(title, 'MISSING'),
#     IFNULL(grade, 0)
# FROM students
# LEFT JOIN papers
#     ON students.id = papers.student_id;

# SELECT
#     first_name,
#     IFNULL(AVG(grade), 0) AS average
# FROM students
# LEFT JOIN papers
#     ON students.id = papers.student_id
# GROUP BY students.id
# ORDER BY average DESC;

# SELECT first_name, 
#        Ifnull(Avg(grade), 0) AS average, 
#        CASE 
#          WHEN Avg(grade) IS NULL THEN 'FAILING' 
#          WHEN Avg(grade) >= 75 THEN 'PASSING' 
#          ELSE 'FAILING' 
#        end                   AS passing_status 
# FROM   students 
#        LEFT JOIN papers 
#               ON students.id = papers.student_id 
# GROUP  BY students.id 
# ORDER  BY average DESC;

# COMPLETED JULY 4th, 2021

COMPLETED SECTION 12 JULY 4th 2021

COMPLETED SECTION 13 VIDEO LECTURES 220 - 223 JULY 4th 2021

In [1]:
# CREATE TABLE reviewers (
#     id INT AUTO_INCREMENT PRIMARY KEY, 
#     first_name VARCHAR(100), 
#     last_name VARCHAR(100)
# )

# CREATE TABLE series (
#     id INT AUTO_INCREMENT PRIMARY KEY,
#     title VARCHAR(100), 
#     released_year YEAR(4),
#     genre VARCHAR(100)
# )

# CREATE TABLE reviews (
#     id INT AUTO_INCREMENT PRIMARY KEY,
#     rating DECIMAL(2, 1),
#     series_id INT, 
#     reviewer_id INT,
#     FOREIGN KEY(series_id) REFERENCES series(id), 
#     FOREIGN KEY(reviewer_id) REFERENCES reviewers(id)
# )

# INSERT INTO series (title, released_year, genre) VALUES
#     ('Archer', 2009, 'Animation'),
#     ('Arrested Development', 2003, 'Comedy'),
#     ("Bob's Burgers", 2011, 'Animation'),
#     ('Bojack Horseman', 2014, 'Animation'),
#     ("Breaking Bad", 2008, 'Drama'),
#     ('Curb Your Enthusiasm', 2000, 'Comedy'),
#     ("Fargo", 2014, 'Drama'),
#     ('Freaks and Geeks', 1999, 'Comedy'),
#     ('General Hospital', 1963, 'Drama'),
#     ('Halt and Catch Fire', 2014, 'Drama'),
#     ('Malcolm In The Middle', 2000, 'Comedy'),
#     ('Pushing Daisies', 2007, 'Comedy'),
#     ('Seinfeld', 1989, 'Comedy'),
#     ('Stranger Things', 2016, 'Drama');

# INSERT INTO reviewers (first_name, last_name) VALUES
#     ('Thomas', 'Stoneman'),
#     ('Wyatt', 'Skaggs'),
#     ('Kimbra', 'Masters'),
#     ('Domingo', 'Cortes'),
#     ('Colt', 'Steele'),
#     ('Pinkie', 'Petit'),
#     ('Marlon', 'Crafford');

# INSERT INTO reviews(series_id, reviewer_id, rating) VALUES
#     (1,1,8.0),(1,2,7.5),(1,3,8.5),(1,4,7.7),(1,5,8.9),
#     (2,1,8.1),(2,4,6.0),(2,3,8.0),(2,6,8.4),(2,5,9.9),
#     (3,1,7.0),(3,6,7.5),(3,4,8.0),(3,3,7.1),(3,5,8.0),
#     (4,1,7.5),(4,3,7.8),(4,4,8.3),(4,2,7.6),(4,5,8.5),
#     (5,1,9.5),(5,3,9.0),(5,4,9.1),(5,2,9.3),(5,5,9.9),
#     (6,2,6.5),(6,3,7.8),(6,4,8.8),(6,2,8.4),(6,5,9.1),
#     (7,2,9.1),(7,5,9.7),
#     (8,4,8.5),(8,2,7.8),(8,6,8.8),(8,5,9.3),
#     (9,2,5.5),(9,3,6.8),(9,4,5.8),(9,6,4.3),(9,5,4.5),
#     (10,5,9.9),
#     (13,3,8.0),(13,4,7.2),
#     (14,2,8.5),(14,3,8.9),(14,4,8.9);

In [1]:
# SECTION 13 CODE CHALLENGE 1 (LECTURE 224)

# SELECT 
#     title, 
#     rating 
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id;

In [2]:
# SECTION 13 CODE CHALLENGE 1 SOLUTION (LECTURE 225)

# SELECT 
#     title, 
#     rating 
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id;

# COMPLETED ON JULY 4th 2021

In [3]:
# SECTION 13 CODE CHALLENGE 2 (LECTURE 226)

# SELECT 
#     title,
#     AVG(rating) AS avg_rating
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id
# GROUP BY series_id
# ORDER BY avg_rating;

In [4]:
# SECTION 13 CODE CHALLENGE 2 SOLUTION (LECTURE 227)

# SELECT
#     title,
#     AVG(rating) as avg_rating
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id
# GROUP BY series.id
# ORDER BY avg_rating;

# COMPLETED JULY 4th 2021

In [5]:
# SECTION 13 CODE CHALLENGE 3 (LECTURE 228)

# SELECT
#     first_name,
#     last_name,
#     rating
# FROM reviewers
# JOIN reviews
#     ON reviewers.id = reviews.reviewer_id;

In [6]:
# SECTION 13 CODE CHALLENGE 3 SOLUTION (LECTURE 229)

# SELECT
#     first_name,
#     last_name,
#     rating
# FROM reviews
# INNER JOIN reviewers
#     ON reviewers.id = reviews.reviewer_id;

# COMPLETED JULY 4th 2021

In [7]:
# SECTION 13 CODE CHALLENGE 4 (LECTURE 230)

# SELECT
#     title AS unreviewed_series
# FROM series
# LEFT JOIN reviews
#     ON series.id = reviews.series_id
# WHERE rating IS NULL;

In [8]:
# SECTION 13 CODE CHALLENGE 4 SOLUTION (LECTURE 231)

# SELECT title AS unreviewed_series
# FROM series
# LEFT JOIN reviews
#     ON series.id = reviews.series_id
# WHERE rating IS NULL;

# COMPLETED JULY 4th 2021

In [1]:
# SECTION 13 CODE CHALLENGE 5 (LECTURE 232)

# SELECT
#     genre,
#     AVG(rating) AS avg_rating
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id
# GROUP BY genre;

In [2]:
# SECTION 13 CODE CHALLENGE 5 SOLUTION (LECTURE 233)

# SELECT genre, 
#        Round(Avg(rating), 2) AS avg_rating 
# FROM   series 
#        INNER JOIN reviews 
#                ON series.id = reviews.series_id 
# GROUP  BY genre; 

# COMPLETED JULY 4 2021

In [3]:
# SECTION 13 CODE CHALLENGE 6 (LECTURE 234)

# SELECT
#     first_name,
#     last_name,
#     COUNT(rating) AS 'COUNT',
#     IFNULL(MIN(rating), 0) AS 'MIN',
#     IFNULL(MAX(rating), 0) AS 'MAX',
#     IFNULL(AVG(rating), 0) AS 'AVG',
#     CASE
#         WHEN COUNT(rating) = 0 THEN 'INACTIVE'
#         ELSE 'ACTIVE'
#     END AS 'STATUS'
# FROM reviewers
# LEFT JOIN reviews
#     ON reviewers.id = reviews.reviewer_id
# GROUP BY reviewers.id;

In [4]:
# SECTION 13 CODE CHALLENGE 6 SOLUTION (LECTURE 235)

# SELECT first_name, 
#        last_name, 
#        Count(rating)                               AS COUNT, 
#        Ifnull(Min(rating), 0)                      AS MIN, 
#        Ifnull(Max(rating), 0)                      AS MAX, 
#        Round(Ifnull(Avg(rating), 0), 2)            AS AVG, 
#        IF(Count(rating) > 0, 'ACTIVE', 'INACTIVE') AS STATUS 
# FROM   reviewers 
#        LEFT JOIN reviews 
#               ON reviewers.id = reviews.reviewer_id 
# GROUP  BY reviewers.id; 

# Instead of IF, the CASE statement ca be use as well

# COMPLETED JULY 4 2021

In [5]:
# SECTION 13 CODE CHALLENGE 7 (LECTURE 236)

# SELECT
#     title,
#     rating,
#     CONCAT(first_name, ' ', last_name) AS 'reviewer'
# FROM series
# JOIN reviews
#     ON series.id = reviews.series_id
# JOIN reviewers
#     ON reviews.reviewer_id = reviewers.id
# ORDER BY title;

In [6]:
# SECTION 13 CODE CHALLENGE 7 SOLUTION (LECTURE 237)

# SELECT 
#     title,
#     rating,
#     CONCAT(first_name,' ', last_name) AS reviewer
# FROM reviewers
# INNER JOIN reviews 
#     ON reviewers.id = reviews.reviewer_id
# INNER JOIN series
#     ON series.id = reviews.series_id
# ORDER BY title;

# COMPLETED JULY 4, 2021

COMPLETED SECTION 13 JULY 4, 2021

In [1]:
# LECTURE 240 USERS SCHEMA ROUGH DRAFT

# CREATE DATABASE instagram_db
# USE instagram_db

# CREATE TABLE users (
#     user_id INT AUTO_INCREMENT PRIMARY KEY,
#     first_name VARCHAR(50),
#     last_name VARCHAR(50),
#     username VARCHAR(50),
#     created DATETIME DEFAULT NOW()
# );

In [2]:
# LECTURE 241 USERS SCHEMA SUGGESTED CODE

# CREATE TABLE users (
#     id INTEGER AUTO_INCREMENT PRIMARY KEY,
#     username VARCHAR(255) UNIQUE NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW()
# );

# Differences between my work and the suggested code is that the username cannot be null and is unique.
# Another small difference is that the created column is a TIMESTAMP instead of DATETIME. Both work.
# COMPLETED JULY 10th, 2021

In [1]:
# LECTURE 242 PICTURES SCHEMA ROUGH DRAFT

# CREATE TABLE photos (
#     id INT AUTO_INCREMENT PRIMARY KEY,
#     user_id INT NOT NULL, 
#     photo_url VARCHAR(250) UNIQUE NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(user_id) REFERENCES users(id)
# );

In [2]:
# LECTURE 243 PICTURES SCHEMA SUGGESTED CODE

# CREATE TABLE photos (
#     id INTEGER AUTO_INCREMENT PRIMARY KEY,
#     image_url VARCHAR(255) NOT NULL,
#     user_id INTEGER NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(user_id) REFERENCES users(id)
# );

# Order is slightly different, but all the important columns are in the table correctly.
# COMPLETED JULY 10, 2021

In [3]:
# LECTURE 244 COMMENTS SCHEMA ROUGH DRAFT

# CREATE TABLE comments (
#     id INTEGER AUTO_INCREMENT PRIMARY KEY,
#     comment VARCHAR(255) NOT NULL,
#.    photo_id INTEGER NOT NULL
#     user_id INTEGER NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(user_id) REFERENCES users(id),
#     FOREIGN KEY(photo_id) REFERENCES photos(id)
# );

In [4]:
# LECTURE 245 COMMENTS SCHEMA SUGGESTED CODE

# CREATE TABLE comments (
#     id INTEGER AUTO_INCREMENT PRIMARY KEY,
#     comment_text VARCHAR(255) NOT NULL,
#     photo_id INTEGER NOT NULL,
#     user_id INTEGER NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(photo_id) REFERENCES photos(id),
#     FOREIGN KEY(user_id) REFERENCES users(id)
# );

# Slightly different order, but overall rough draft was correct.
# COMPLETED JULY 10th, 2021

In [1]:
# LECTURE 246 LIKES SCHEMA ROUGH DRAFT

# CREATE TABLE likes (
#     liked_id INT NOT NULL,
#     liker_id INT NOT NULL UNIQUE,
#     photo_id INT NOT NULL,
#.    created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(liked_id) REFERENCES users(id),
#     FOREIGN KEY(liker_id) REFERENCES users(id),
#     FOREIGN KEY(photo_id) REFERENCES photos(id)
# )

In [2]:
# LECTURE 247 LIKES SCHEMA SUGGESTED CODE

# CREATE TABLE likes (
#     user_id INTEGER NOT NULL,
#     photo_id INTEGER NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(user_id) REFERENCES users(id),
#     FOREIGN KEY(photo_id) REFERENCES photos(id),
#     PRIMARY KEY(user_id, photo_id)
# );

# My rough draft didn't need the id of the person who took the photo because that information already exists in
# another table. Also the problem with using unique is that it would only allow someone to like one thing. Using 
# the primary key with both user and photo id makes sure that each person can only like the item once.

# Completed July 11, 2021

In [1]:
# LECTURE 248 FOLLOWERS SCHEMA ROUGH DRAFT

# CREATE TABLE followers (
#     following_id INT NOT NULL,
#     follower_id INT NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(following_id) REFERENCES users(id),
#     FOREIGN KEY(follower_id) REFERENCES users(id),
#     PRIMARY KEY(following_id, follower_id)
# )

In [2]:
# LECTURE 249 FOLLOWERS SCHEMA SUGGESTED CODE

# CREATE TABLE follows (
#     follower_id INTEGER NOT NULL,
#     followee_id INTEGER NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#     FOREIGN KEY(follower_id) REFERENCES users(id),
#     FOREIGN KEY(followee_id) REFERENCES users(id),
#     PRIMARY KEY(follower_id, followee_id)
# );

# Work is correct

# Completed July 11, 2021

In [1]:
# LECTURE 250 HASHTAG SCHEMA ROUGH DRAFT

# CREATE TABLE hashtags (
#     id INT AUTO_INCREMENT PRIMARY KEY,
#     tag VARCHAR(255) NOT NULL,
#.    photo_id INT NOT NULL,
#     created_at TIMESTAMP DEFAULT NOW(),
#.    FOREIGN KEY(photo_id) REFERENCES photos(id)
# )

In [2]:
# LECTURE 251-253 HASHTAG SCHEMA SUGGESTED CODE

# CREATE TABLE tags (
#   id INTEGER AUTO_INCREMENT PRIMARY KEY,
#   tag_name VARCHAR(255) UNIQUE,
#   created_at TIMESTAMP DEFAULT NOW()
# );
# CREATE TABLE photo_tags (
#     photo_id INTEGER NOT NULL,
#     tag_id INTEGER NOT NULL,
#     FOREIGN KEY(photo_id) REFERENCES photos(id),
#     FOREIGN KEY(tag_id) REFERENCES tags(id),
#     PRIMARY KEY(photo_id, tag_id)
# );

# Suggested code created two tables for tags. Added a table specifically for different types of tags. Makes sense

# Completed July 11th, 2021

COMPLETED SECTION 14 JULY 11th, 2021

COMPLETED VIDEO LECTUREs SECTION 14 # 255-258 July 16, 2021

CREATED DATABASE, TABLES, and DATA in GOORMIDE July16, 2021

In [1]:
# SECTION 15 CODE CHALLENGE 1
# We want to reward our users who have been around the longest. Find the five oldest users.

# SELECT usernames
# FROM users
# ORDER BY created_at
# LIMIT 5;

In [2]:
# SECTION 15 CODE CHALLENGE 1 SOLUTION

# SELECT * 
# FROM users
# ORDER BY created_at
# LIMIT 5;

# The difference is selecting star rather than only the usernames. Work is still correct.
# COMPELTED July 16th, 2021

In [3]:
# SECTION 15 CODE CHALLENGE 2
# What day of the week do most users register on? We need to know when to schedule an ad campaign.

# SELECT DAYNAME(created_at) AS Day, 
#        COUNT(DAYNAME(created_at)) as Registered 
# FROM users GROUP BY DAYNAME(created_at) 
# ORDER BY Registered DESC;

In [4]:
# SECTION 15 CODE CHALLENGE 2 SOLUTION

# SELECT 
#     DAYNAME(created_at) AS day,
#     COUNT(*) AS total
# FROM users
# GROUP BY day
# ORDER BY total DESC
# LIMIT 2;

# Differences are using star for the count function, column aliases and limiting the query to two results.
# Still returns correct result: the two most common days are the top, with less common below.

# Completed July 16, 2021

In [1]:
# SECTION 15 CODE CHALLENGE 3
# We want to target our inactive users with an email campaign. Find the users who have never posted a photo.

# SELECT username, COUNT(photos.id) AS total_posts
#     -> FROM users
#     -> LEFT JOIN photos
#     -> ON users.id = photos.user_id
#     -> GROUP BY username
#     -> HAVING total_posts = 0;

In [2]:
# SECTION 15 CODE CHALLENGE 3 SOLUTION

# SELECT username
# FROM users
# LEFT JOIN photos
#     ON users.id = photos.user_id
# WHERE photos.id IS NULL;

# Both codes have the same end result, which completes the challenge. The soluton is different because it skips
# the GROUP BY and HAVING statements and instead goes straight to WHERE IS NULL. Don't need the GROUP BY statement
# because the usernames with no photos will show up only once in a LEFT JOIN, so only needs the WHERE IS NULL.

# COMPLETED July 17, 2021

In [3]:
# SECTION 15 CODE CHALLENGE 4
# We're running a new contest to see who can get the most likes on a single photo. Who Won???

# The following query will return the top three user ids of singular most liked photos. This can find the top
# person by changing limit to 1 (was at 3 to make sure there were no ties)

# SELECT photos.user_id, photos.id, COUNT(likes.user_id) AS total_likes 
#     FROM photos 
#     LEFT JOIN likes 
#         ON photos.id = likes.photo_id 
#     GROUP BY photos.id 
#     ORDER BY total_likes DESC 
#     LIMIT 3;

# Or the following will give the username of the individual who won

# SELECT users.username, photos.image_url, COUNT(likes.user_id) AS total_likes 
# FROM users 
# INNER JOIN photos 
#     ON users.id = photos.user_id 
# LEFT JOIN likes 
#     ON photos.id = likes.photo_id 
# GROUP BY photos.id 
# ORDER BY total_likes DESC 
# LIMIT 1;

In [4]:
# SECTION 15 CODE CHALLENGE 4 SOLUTION

# SELECT 
#     username,
#     photos.id,
#     photos.image_url, 
#     COUNT(*) AS total
# FROM photos
# INNER JOIN likes
#     ON likes.photo_id = photos.id
# INNER JOIN users
#     ON photos.user_id = users.id
# GROUP BY photos.id
# ORDER BY total DESC
# LIMIT 1;

# Slightly different syntax and where to join, but the end results are the same.

# COMPLETED July 17, 2021

In [1]:
# SECTION 15 CODE CHALLENGE 5
# Our investors want to know how many times does an average user post?

# SELECT ((SELECT COUNT(id) FROM photos) / (SELECT COUNT(id) FROM users)) AS Average;

In [2]:
# SECTION 15 CODE CHALLENGE % SOLUTION

# SELECT (SELECT Count(*) 
#         FROM   photos) / (SELECT Count(*) 
#                           FROM   users) AS avg; 

# Work is correct
# COMPLETED JULY 17, 2021

In [3]:
# SECTION 15 CODE CHALLENGE 6
# A brand wants to know which hashtags to use in a post. What are the top 5 most commonly used hashtags?

# SELECT 
#     tags.tag_name, 
#     photo_tags.tag_id, 
#     COUNT(photo_tags.photo_id) AS number_of_photos 
# FROM photo_tags
# JOIN tags 
#     ON tags.id = photo_tags.tag_id 
# GROUP BY photo_tags.tag_id 
# ORDER BY number_of_photos DESC 
# LIMIT 5;

# OR to just get the tag names

# SELECT 
#     tags.tag_name 
# FROM photo_tags
# JOIN tags 
#     ON tags.id = photo_tags.tag_id 
# GROUP BY photo_tags.tag_id 
# ORDER BY COUNT(photo_tags.photo_id) DESC 
# LIMIT 5;

In [4]:
# SECTION 15 CODE CHALLENGE 6 SOLUTION

# SELECT tags.tag_name, 
#        Count(*) AS total 
# FROM   photo_tags 
#        JOIN tags 
#          ON photo_tags.tag_id = tags.id 
# GROUP  BY tags.id 
# ORDER  BY total DESC 
# LIMIT  5; 

# WORK IS CORRECT

# COMPLETED JULY 17, 2021

In [1]:
# SECTION 15 CODE CHALLENGE 7
# We have a small problem with bots on our site... Find users that have a liked every single photo on the site.

# SELECT user_id, COUNT(photo_id) AS photos_liked FROM likes GROUP BY user_id HAVING photos_liked = MAX(photo_id);

# Or if you just want the id

# SELECT user_id FROM likes GROUP BY user_id HAVING COUNT(photo_id) = MAX(photo_id);

# OR if you want the username

# SELECT username
# FROM users
# JOIN likes
#     ON users.id = likes.user_id
# GROUP BY user_id
# HAVING COUNT(likes.photo_id) = MAX(likes.photo_id);

In [2]:
# SECTION 15 CODE CHALLENGE 7 SOLUTION

# SELECT username, 
#        Count(*) AS num_likes 
# FROM   users 
#        INNER JOIN likes 
#                ON users.id = likes.user_id 
# GROUP  BY likes.user_id 
# HAVING num_likes = (SELECT Count(*) 
#                     FROM   photos); 

# Returns same results, but by using a subquery using the photos table, we can make sure that the MAX number of
# photo_id from the likes table is equal to the total number of photos in the photo table

# COMPLETED JULY 17, 2021

In [3]:
# SECTION 15 CODE CHALLENGE 8
# WE also have a problem with celebrities... Find the users who have never commented on a photo.

# SELECT 
#     username 
# FROM users 
# LEFT JOIN comments 
#     ON users.id = comments.user_id 
# WHERE comments.comment_text IS NULL;

In [4]:
# SECTION 15 CODE MEGA CHALLENGE

# SELECT (
#     (
#     SELECT COUNT(username)
#     FROM users
#     LEFT JOIN comments
#         ON users.id = comments.user_id
#     WHERE comments.comment_text IS NULL
#     )
#     +
#     (
#     SELECT username
#     FROM users
#     JOIN likes
#         ON users.id = likes.user_id
#     GROUP BY likes.user_id
#     HAVING COUNT(likes.photo_id) = (SELECT COUNT(*) FROM photos)
#     )
#     /
#     (SELECT COUNT(*) FROM users)
#     * 100
# )

# NOT YET FINISHED!!!

COMPLETED SECTION 16 274-284 July 24, 2021

In [1]:
# Completed Section 16 Video Lecture 285 - 288
# Below is connecting the node.js to mysql database and testing a query.

# var faker = require('faker');

# var mysql = require('mysql');

# var connection = mysql.createConnection({
# 	host	: 'localhost',
# 	user	: 'root',
# 	database: 'join_us'
# });

# connection.query('SELECT 1 + 1 AS solution', function (error, results, fields) {
#    if (error) throw error;
#    console.log('The solution is: ', results[0].solution);
# });

# connection.end();

# COMPLETED July 25, 2021

In [1]:
# Completed Section 16 Video Lectures 289 - 292
# Below is sql and node js code to add a table and a couple users to the database join_us and a node query
# of those users

# CREATE TABLE users (
#     email VARCHAR(255) PRIMARY KEY,
#     created_at TIMESTAMP DEFAULT NOW()
# )

# INSERT INTO users(email) VALUEs ('Katie34@yahoo.com'), ('Tunde@gmail.com');

# var faker = require('faker');

# var mysql = require('mysql');

# var connection = mysql.createConnection({
# 	host	: 'localhost',
# 	user	: 'root',
# 	database: 'join_us'
# });

# var q = 'SELECT * FROM users'

# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

In [1]:
# COMPLETED SECTION 16 VIDEO LECTURES 292 - 297
# ADDED 500 new users to users datatable

# Entering 500 new users
# var data = [];

# for(var i = 0; i<500; i++){
# 	data.push([
# 		faker.internet.email(),
# 		faker.date.past()
# 	]);
# }

# var q = "INSERT INTO users(email, created_at) VALUES ?"

# connection.query(q, [data], function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# COMPELTED JULY 25, 2021

In [1]:
# SECTION 16 CODE CHALLENGES

# var mysql = require('mysql');

# var connection = mysql.createConnection({
# 	host	: 'localhost',
# 	user	: 'root',
# 	database: 'join_us'
# });

# EXERCISE 1

# var q = 'SELECT DATE_FORMAT(created_at, "%M %D %Y") AS earliest_date FROM users ORDER BY created_at LIMIT 1'
# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# EXERCISE 2

# var q = 'SELECT email, created_at FROM users ORDER BY created_at LIMIT 1'
# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# EXERCISE 3

# var q = 'SELECT MONTHNAME(created_at) AS month, COUNT(*) AS count FROM users GROUP BY month ORDER BY count DESC'
# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# EXERCISE 4

# var q = 'SELECT COUNT(*) AS yahoo_users FROM users WHERE email LIKE "%yahoo%"'
# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# EXERCISE 5

# var q = 'SELECT CASE WHEN email LIKE "%yahoo%" THEN "yahoo" WHEN email LIKE "%gmail%" THEN "gmail" WHEN email LIKE "%hotmail%" THEN "hotmail" ELSE "other" END AS provider, COUNT(*) AS total_users FROM users GROUP BY provider ORDER BY total_users DESC'
# connection.query(q, function (error, results, fields) {
#    if (error) throw error;
#    console.log(results);
# });

# connection.end();

# COMPLETED JULY 25, 2021

COMPLETED SECTION 17 VIDEO LECTURES 298 - 307

In [1]:
# Created Simple App using Nodejs

# First created a new file and node js package

## npm init

# Next installed express, faker, and mysql

## npm install express --save
## npm install faker mysql --save

# Created a new app in app.js file

### var express = require('express');

### var app = express();

### app.get("/", function(req, res){
### 		res.send("HELLO FROM OUR WEBAPP!!!")
### 		}
### );

### app.listen(3000, function() {
### 	console.log("Server running on port 1000!");
### });

# COMPLETED July 31, 2021

In [1]:
# COMPLETES VIDEO LECTURES 308-309 and Adds multiple routes to practice app.

# var express = require('express');

# var app = express();

# app.get("/", function(req, res){
# 		res.send("HELLO FROM OUR WEBAPP!!!")
# 		}
# );

# app.get('/joke', function(req, res){
# 	var joke = "What do you call a dog that does magic tricks? A labracadabrador!";
# 	res.send(joke)
# });

# app.get("/random_num", function(req, res){
# 	var lucky_num = Math.floor((Math.random() * 10) + 1);
# 	res.send("Yourn lucky number is " + lucky_num);
# })

# app.listen(3000, function() {
# 	console.log("Server running on port 1000!");
# });